# Есть баг в приложении, который вы знаете и который должен быть исправлен позже.
# Тесты зависят от стороннего сервиса или ресурса, который временно недоступен.
# Когда есть проблемы в инфраструктуре, из-за которых тесты могут временно не работать.
# Reason - обязателен

import pytest


@pytest.mark.xfail(reason='Найден баг в приложении, из-за которого тест падает с ошибкой')
def test_with_bug():
    assert 1 == 2


@pytest.mark.xfail(reason='Баг уже исправлен, но на тест все еще висит маркировка xfail')
def test_without_bug():
    pass


@pytest.mark.xfail(reason='Внешний сервис временно недоступен')
def test_external_services_is_unavailable():
    assert 1 == 2